#άσκηση 11

import pandas as pd
import numpy as np

df = pd.read_csv("sales_transactions.csv") #διαβάζει
df = df[(df["Έσοδα"] > 0) & (df["Κόστος"] >= 0)].copy() #αγνοεί τα έξοδα μικρότερα του 0 ή με αρνητικό κόστος

#///////////

df["Κέρδος"] = df["Έσοδα"] - df["Κόστος"] #έσοδα
df["Περιθώριο_Κέρδους%"] = (df["Κέρδος"] / df["Έσοδα"]) * 100 #περιθ. κέρδους επί τις εκ.

#//////////

αναφορά_πελάτη = df.groupby("Πελάτης").agg( #ρεπόρτ πελάτη με όλες τις πληροφορίες
    σ_έσοδα = ("Έσοδα", "sum"),
    σ_κόστος = ("Κόστος", "sum"),
    σ_κέρδος = ("Κέρδος", "sum"),
    μέσο_περιθώριο_κέρδους = ("Περιθώριο_Κέρδους_%", "mean"),
    εκκρεμή_έσοδα = ("Εκκρεμή_Έσοδα", "sum")
).reset_index()

#///////////////////

αναφορά_πελάτη["Βαθμός_Ρίσκου"] = 0 #υπολογισμός βαθμού ρίσκου

αναφορά_πελάτη.loc[
    αναφορά_πελάτη["Εκκρεμή_Έσοδα"] > 0.30 * αναφορά_πελάτη["Συνολικά_Έσοδα"],
    "Βαθμός_Ρίσκου"
] +=5

αναφορά_πελάτη.loc[
    
]






